## Lab 11
1. WAP using Pandas to add multiple series in a data frame
2. WAP using Pandas to display the default index and set a column as an Index in a given dataframe.
3. WAP using Pandas to add multiple disctionaries in a data frame
4. WAP using Pandas to create a data frame with columns Name, Marks1, Marks2, Marks3, Marks4, Marks5, Total. Total is sum of marks1 to marks5 in each row.
5. WAP using Pandas with dataframe of Ex 4 to find the students who scored more then 50% marks in total
6. WAP using Pandas with dataframe of Ex 4 to find the students who scored more than 50% in total and marks1
7. WAP using Pandas with dataframe of Ex 4 to find the students who scored more than 50% in total but less than 40 in marks1
8. WAP using Pandas  with dataframe of Ex 4 to find the students who scored max marks in total and marks1
9. WAP using Pandas with dataframe of Ex 4 to find the students who scored more than the mean of total
10. WAP using Pandas with dataframe of Ex 4 to find the students who scored more than the mean of total and marks1

In [1]:
import pandas as pd
import numpy as np

In [15]:
df = pd.DataFrame({
    '1':pd.Series([1,2,3,4]),
    '2':pd.Series([4,5])
})
df

   1    2
0  1  4.0
1  2  5.0
2  3  NaN
3  4  NaN

In [16]:
b = df.index
b[0]

0

In [17]:
a = df.columns
a[0]

'1'

In [54]:
df = pd.DataFrame({
    'Name':pd.Series(["Tanya","Zayn"]),
    'Marks1':[80,5],
    'Marks2':[10,5],
    'Marks3':[10,5],
    'Marks4':[10,5],
    'Marks5':[60,95],
})
df['Total']=df['Marks1']+df['Marks2']+df['Marks3']+df['Marks4']+df['Marks5']
df

    Name  Marks1  Marks2  Marks3  Marks4  Marks5  Total
0  Tanya      80      10      10      10      60    170
1   Zayn       5       5       5       5      95    115

In [57]:
df[df.Total>50]

    Name  Marks1  Marks2  Marks3  Marks4  Marks5  Total
0  Tanya      80      10      10      10      60    170
1   Zayn       5       5       5       5      95    115

In [62]:
df.loc[(df.Total>50) & (df.Marks1>50)]

    Name  Marks1  Marks2  Marks3  Marks4  Marks5  Total
0  Tanya      80      10      10      10      60    170

In [37]:
a = df[df.Total>50]
df[a.Marks1<40]

   Name  Marks1  Marks2  Marks3  Marks4  Marks5  Total
1  Zayn       5       5       5       5      95    115

In [65]:
a = df.loc[max(df['Total']) & max(df['Marks1'])]
a

Name      Tanya
Marks1       80
Marks2       10
Marks3       10
Marks4       10
Marks5       60
Total       170
Name: 0, dtype: object

In [72]:
a = df['Total'].mean()
b = df['Marks1'].mean()
df.loc[(df['Total']>a) & (df['Marks1']>b)]

    Name  Marks1  Marks2  Marks3  Marks4  Marks5  Total
0  Tanya      80      10      10      10      60    170